# 순위   영화  예매율   평점
# 1     기생충  30.1   7.8
# 1     엔드게임  50.1   4.4
# 1     너의 이름은  21.1   8.1
# 1     어바웃타임  45.1   9.2
list_data1 = [1, '기생충', 30.1, 7.8]
dic_data1 = {'순위':1, '영화':'기생충', '예매율': 30.1, '평점': 7.8}
dic_data2 = {'순위':2, '영화':'엔드게임', '예매율': 50.1, '평점': 4.4}
dic_data3 = {'순위':3, '영화':'너의 이름은', '예매율': 21.1, '평점': 8.1}
dic_data4 = {'순위':4, '영화':'어바웃 타임', '예매율': 45.1, '평점': 9.2}

dic_movie = [{'순위':1, '영화':'기생충', '예매율': 30.1, '평점': 7.8},
             {'순위':2, '영화':'엔드게임', '예매율': 50.1, '평점': 4.4},
             {'순위':3, '영화':'너의 이름은', '예매율': 21.1, '평점': 8.1},
             {'순위':4, '영화':'어바웃 타임', '예매율': 45.1, '평점': 9.2}]

for item in dic_movie:
    print(item['영화'])

dic_movie2 = {'기생충':{'순위': 1, '예매율': 30.1, '평점': 7.8},
            '엔드게임': {'순위': 2, '예매율': 50.1, '평점': 4.4},
            '너의 이름은': {'순위': 3, '예매율': 21.1, '평점': 8.1},
            '어바웃 타임': {'순위': 4, '예매율': 45.1, '평점': 9.2}}

print(dic_movie2)
print(dic_movie2['기생충'])
print(dic_movie2['기생충']['순위'])